micropython/micropython/stmhal/cmsis/devinc/stm32f215xx.h
/******************  Bit definition for USART_CR2 register  *******************/
#define  USART_CR2_ADD                       ((uint32_t)0x0000000F)            /*!<Address of the USART node */
#define  USART_CR2_LBDL                      ((uint32_t)0x00000020)            /*!<LIN Break Detection Length */
#define  USART_CR2_LBDIE                     ((uint32_t)0x00000040)            /*!<LIN Break Detection Interrupt Enable */
#define  USART_CR2_LBCL                      ((uint32_t)0x00000100)            /*!<Last Bit Clock pulse */
#define  USART_CR2_CPHA                      ((uint32_t)0x00000200)            /*!<Clock Phase */
#define  USART_CR2_CPOL                      ((uint32_t)0x00000400)            /*!<Clock Polarity */
#define  USART_CR2_CLKEN                     ((uint32_t)0x00000800)            /*!<Clock Enable */

#define  USART_CR2_STOP                      ((uint32_t)0x00003000)            /*!<STOP[1:0] bits (STOP bits) */
#define  USART_CR2_STOP_0                    ((uint32_t)0x00001000)            /*!<Bit 0 */
#define  USART_CR2_STOP_1                    ((uint32_t)0x00002000)            /*!<Bit 1 */

#define  USART_CR2_LINEN                     ((uint32_t)0x00004000)            /*!<LIN mode enable */

/******************  Bit definition for USART_CR3 register  *******************/
#define  USART_CR3_EIE                       ((uint32_t)0x00000001)            /*!<Error Interrupt Enable */
#define  USART_CR3_IREN                      ((uint32_t)0x00000002)            /*!<IrDA mode Enable */
#define  USART_CR3_IRLP                      ((uint32_t)0x00000004)            /*!<IrDA Low-Power */
#define  USART_CR3_HDSEL                     ((uint32_t)0x00000008)            /*!<Half-Duplex Selection */
#define  USART_CR3_NACK                      ((uint32_t)0x00000010)            /*!<Smartcard NACK enable */
#define  USART_CR3_SCEN                      ((uint32_t)0x00000020)            /*!<Smartcard mode enable */
#define  USART_CR3_DMAR                      ((uint32_t)0x00000040)            /*!<DMA Enable Receiver */
#define  USART_CR3_DMAT                      ((uint32_t)0x00000080)            /*!<DMA Enable Transmitter */
#define  USART_CR3_RTSE                      ((uint32_t)0x00000100)            /*!<RTS Enable */
#define  USART_CR3_CTSE                      ((uint32_t)0x00000200)            /*!<CTS Enable */
#define  USART_CR3_CTSIE                     ((uint32_t)0x00000400)            /*!<CTS Interrupt Enable */
#define  USART_CR3_ONEBIT                    ((uint32_t)0x00000800)            /*!<USART One bit method enable */

/******************  Bit definition for USART_GTPR register  ******************/
#define  USART_GTPR_PSC                      ((uint32_t)0x000000FF)            /*!<PSC[7:0] bits (Prescaler value) */
#define  USART_GTPR_PSC_0                    ((uint32_t)0x00000001)            /*!<Bit 0 */
#define  USART_GTPR_PSC_1                    ((uint32_t)0x00000002)            /*!<Bit 1 */
#define  USART_GTPR_PSC_2                    ((uint32_t)0x00000004)            /*!<Bit 2 */
#define  USART_GTPR_PSC_3                    ((uint32_t)0x00000008)            /*!<Bit 3 */
#define  USART_GTPR_PSC_4                    ((uint32_t)0x00000010)            /*!<Bit 4 */
#define  USART_GTPR_PSC_5                    ((uint32_t)0x00000020)            /*!<Bit 5 */
#define  USART_GTPR_PSC_6                    ((uint32_t)0x00000040)            /*!<Bit 6 */
#define  USART_GTPR_PSC_7                    ((uint32_t)0x00000080)            /*!<Bit 7 */

#define  USART_GTPR_GT                       ((uint32_t)0x0000FF00)            /*!<Guard time value */

/******************************************************************************/
/*                                                                            */
/*                            Window WATCHDOG                                 */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for WWDG_CR register  ********************/
#define  WWDG_CR_T                           ((uint32_t)0x0000007F)               /*!<T[6:0] bits (7-Bit counter (MSB to LSB)) */
#define  WWDG_CR_T0                          ((uint32_t)0x00000001)               /*!<Bit 0 */
#define  WWDG_CR_T1                          ((uint32_t)0x00000002)               /*!<Bit 1 */
#define  WWDG_CR_T2                          ((uint32_t)0x00000004)               /*!<Bit 2 */
#define  WWDG_CR_T3                          ((uint32_t)0x00000008)               /*!<Bit 3 */
#define  WWDG_CR_T4                          ((uint32_t)0x00000010)               /*!<Bit 4 */
#define  WWDG_CR_T5                          ((uint32_t)0x00000020)               /*!<Bit 5 */
#define  WWDG_CR_T6                          ((uint32_t)0x00000040)               /*!<Bit 6 */

#define  WWDG_CR_WDGA                        ((uint32_t)0x00000080)               /*!<Activation bit */

/*******************  Bit definition for WWDG_CFR register  *******************/
#define  WWDG_CFR_W                          ((uint32_t)0x0000007F)            /*!<W[6:0] bits (7-bit window value) */
#define  WWDG_CFR_W0                         ((uint32_t)0x00000001)            /*!<Bit 0 */
#define  WWDG_CFR_W1                         ((uint32_t)0x00000002)            /*!<Bit 1 */
#define  WWDG_CFR_W2                         ((uint32_t)0x00000004)            /*!<Bit 2 */
#define  WWDG_CFR_W3                         ((uint32_t)0x00000008)            /*!<Bit 3 */
#define  WWDG_CFR_W4                         ((uint32_t)0x00000010)            /*!<Bit 4 */
#define  WWDG_CFR_W5                         ((uint32_t)0x00000020)            /*!<Bit 5 */
#define  WWDG_CFR_W6                         ((uint32_t)0x00000040)            /*!<Bit 6 */

#define  WWDG_CFR_WDGTB                      ((uint32_t)0x00000180)            /*!<WDGTB[1:0] bits (Timer Base) */
#define  WWDG_CFR_WDGTB0                     ((uint32_t)0x00000080)            /*!<Bit 0 */
#define  WWDG_CFR_WDGTB1                     ((uint32_t)0x00000100)            /*!<Bit 1 */

